load-tests/k6-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/api-load-tests.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m02.0s/1m00.0s

running (0m03.0s), 01/10 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 01/10 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  0m04.0s/1m00.0s

running (0m05.0s), 02/10 VUs, 0 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  0m05.0s/1m00.0s

running (0m06.0s), 02/10 VUs, 1 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  0m06.0s/1m00.0s

running (0m07.0s), 02/10 VUs, 2 complete and 0 interrupted iterations
default   [  12% ] 02/10 VUs  0m07.0s/1m00.0s

running (0m08.0s), 03/10 VUs, 2 complete and 0 interrupted iterations
default   [  13% ] 03/10 VUs  0m08.0s/1m00.0s

running (0m09.0s), 03/10 VUs, 4 complete and 0 interrupted iterations
default   [  15% ] 03/10 VUs  0m09.0s/1m00.0s

running (0m10.0s), 03/10 VUs, 5 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  0m10.0s/1m00.0s

running (0m11.0s), 03/10 VUs, 7 complete and 0 interrupted iterations
default   [  18% ] 03/10 VUs  0m11.0s/1m00.0s

running (0m12.0s), 04/10 VUs, 8 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  0m12.0s/1m00.0s

running (0m13.0s), 04/10 VUs, 11 complete and 0 interrupted iterations
default   [  22% ] 04/10 VUs  0m13.0s/1m00.0s

running (0m14.0s), 04/10 VUs, 12 complete and 0 interrupted iterations
default   [  23% ] 04/10 VUs  0m14.0s/1m00.0s

running (0m15.0s), 04/10 VUs, 15 complete and 0 interrupted iterations
default   [  25% ] 04/10 VUs  0m15.0s/1m00.0s

running (0m16.0s), 05/10 VUs, 18 complete and 0 interrupted iterations
default   [  27% ] 05/10 VUs  0m16.0s/1m00.0s

running (0m17.0s), 05/10 VUs, 21 complete and 0 interrupted iterations
default   [  28% ] 05/10 VUs  0m17.0s/1m00.0s

running (0m18.0s), 05/10 VUs, 24 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  0m18.0s/1m00.0s

running (0m19.0s), 05/10 VUs, 26 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  0m19.0s/1m00.0s

running (0m20.0s), 05/10 VUs, 30 complete and 0 interrupted iterations
default   [  33% ] 05/10 VUs  0m20.0s/1m00.0s

running (0m21.0s), 06/10 VUs, 33 complete and 0 interrupted iterations
default   [  35% ] 06/10 VUs  0m21.0s/1m00.0s

running (0m22.0s), 06/10 VUs, 36 complete and 0 interrupted iterations
default   [  37% ] 06/10 VUs  0m22.0s/1m00.0s

running (0m23.0s), 06/10 VUs, 39 complete and 0 interrupted iterations
default   [  38% ] 06/10 VUs  0m23.0s/1m00.0s

running (0m24.0s), 06/10 VUs, 44 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  0m24.0s/1m00.0s

running (0m25.0s), 06/10 VUs, 47 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  0m25.0s/1m00.0s

running (0m26.0s), 06/10 VUs, 51 complete and 0 interrupted iterations
default   [  43% ] 06/10 VUs  0m26.0s/1m00.0s

running (0m27.0s), 06/10 VUs, 55 complete and 0 interrupted iterations
default   [  45% ] 06/10 VUs  0m27.0s/1m00.0s

running (0m28.0s), 07/10 VUs, 59 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  0m28.0s/1m00.0s

running (0m29.0s), 07/10 VUs, 63 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  0m29.0s/1m00.0s

running (0m30.0s), 07/10 VUs, 68 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  0m30.0s/1m00.0s
time="2026-07-04T19:16:56-03:00" level=warning msg="Request Failed" error="Get \"https://szcf8ifdpe.execute-api.us-east-1.amazonaws.com/health\": dial: i/o timeout"

running (0m31.0s), 07/10 VUs, 72 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  0m31.0s/1m00.0s

running (0m32.0s), 07/10 VUs, 78 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  0m32.0s/1m00.0s

running (0m33.0s), 07/10 VUs, 84 complete and 0 interrupted iterations
default   [  55% ] 07/10 VUs  0m33.0s/1m00.0s

running (0m34.0s), 08/10 VUs, 88 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  0m34.0s/1m00.0s

running (0m35.0s), 08/10 VUs, 95 complete and 0 interrupted iterations
default   [  58% ] 08/10 VUs  0m35.0s/1m00.0s

running (0m36.0s), 08/10 VUs, 101 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  0m36.0s/1m00.0s

running (0m37.0s), 08/10 VUs, 107 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  0m37.0s/1m00.0s

running (0m38.0s), 08/10 VUs, 113 complete and 0 interrupted iterations
default   [  63% ] 08/10 VUs  0m38.0s/1m00.0s

running (0m39.0s), 08/10 VUs, 119 complete and 0 interrupted iterations
default   [  65% ] 08/10 VUs  0m39.0s/1m00.0s

running (0m40.0s), 09/10 VUs, 125 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  0m40.0s/1m00.0s

running (0m41.0s), 09/10 VUs, 132 complete and 0 interrupted iterations
default   [  68% ] 09/10 VUs  0m41.0s/1m00.0s

running (0m42.0s), 09/10 VUs, 140 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  0m42.0s/1m00.0s

running (0m43.0s), 09/10 VUs, 145 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  0m43.0s/1m00.0s

running (0m44.0s), 09/10 VUs, 153 complete and 0 interrupted iterations
default   [  73% ] 09/10 VUs  0m44.0s/1m00.0s

running (0m45.0s), 09/10 VUs, 160 complete and 0 interrupted iterations
default   [  75% ] 09/10 VUs  0m45.0s/1m00.0s

running (0m46.0s), 10/10 VUs, 168 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  0m46.0s/1m00.0s

running (0m47.0s), 10/10 VUs, 173 complete and 0 interrupted iterations
default   [  78% ] 10/10 VUs  0m47.0s/1m00.0s

running (0m48.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  80% ] 10/10 VUs  0m48.0s/1m00.0s

running (0m49.0s), 09/10 VUs, 188 complete and 0 interrupted iterations
default   [  82% ] 09/10 VUs  0m49.0s/1m00.0s

running (0m50.0s), 09/10 VUs, 194 complete and 0 interrupted iterations
default   [  83% ] 09/10 VUs  0m50.0s/1m00.0s

running (0m51.0s), 08/10 VUs, 199 complete and 0 interrupted iterations
default   [  85% ] 08/10 VUs  0m51.0s/1m00.0s

running (0m52.0s), 08/10 VUs, 204 complete and 0 interrupted iterations
default   [  87% ] 08/10 VUs  0m52.0s/1m00.0s

running (0m53.0s), 06/10 VUs, 210 complete and 0 interrupted iterations
default   [  88% ] 06/10 VUs  0m53.0s/1m00.0s

running (0m54.0s), 06/10 VUs, 214 complete and 0 interrupted iterations
default   [  90% ] 06/10 VUs  0m54.0s/1m00.0s

running (0m55.0s), 05/10 VUs, 217 complete and 0 interrupted iterations
default   [  92% ] 05/10 VUs  0m55.0s/1m00.0s

running (0m56.0s), 05/10 VUs, 220 complete and 0 interrupted iterations
default   [  93% ] 05/10 VUs  0m56.0s/1m00.0s

running (0m57.0s), 04/10 VUs, 224 complete and 0 interrupted iterations
default   [  95% ] 04/10 VUs  0m57.0s/1m00.0s

running (0m58.0s), 03/10 VUs, 226 complete and 0 interrupted iterations
default   [  97% ] 03/10 VUs  0m58.0s/1m00.0s

running (0m59.0s), 03/10 VUs, 228 complete and 0 interrupted iterations
default   [  98% ] 03/10 VUs  0m59.0s/1m00.0s

running (1m00.0s), 02/10 VUs, 229 complete and 0 interrupted iterations
default   [ 100% ] 02/10 VUs  1m00.0s/1m00.0s

running (1m01.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m02.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m03.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m04.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m05.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m06.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m07.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m08.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m09.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m10.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m11.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m12.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m13.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m14.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s

running (1m15.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s
time="2026-07-04T19:17:41-03:00" level=warning msg="Request Failed" error="Get \"https://szcf8ifdpe.execute-api.us-east-1.amazonaws.com/health\": dial: i/o timeout"

running (1m16.0s), 01/10 VUs, 230 complete and 0 interrupted iterations
default ↓ [ 100% ] 02/10 VUs  1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<700' p(95)=168.36ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.28%


  █ TOTAL RESULTS 

    checks_total.......: 691    9.03241/s
    checks_succeeded...: 99.71% 689 out of 691
    checks_failed......: 0.28%  2 out of 691

    ✗ health returns 200
      ↳  99% — ✓ 229 / ✗ 2
    ✓ job returns 200
    ✓ report returns 200

    HTTP
    http_req_duration..............: avg=103.14ms min=0s      med=91.77ms max=343.81ms p(90)=148.13ms p(95)=168.36ms
      { expected_response:true }...: avg=103.44ms min=73.61ms med=91.81ms max=343.81ms p(90)=148.47ms p(95)=168.41ms
    http_req_failed................: 0.28%  2 out of 691
    http_reqs......................: 691    9.03241/s

    EXECUTION
    iteration_duration.............: avg=1.44s    min=1.25s   med=1.31s   max=31.5s    p(90)=1.36s    p(95)=1.41s   
    iterations.....................: 230    3.006446/s
    vus............................: 1      min=1        max=10
    vus_max........................: 10     min=10       max=10

    NETWORK
    data_received..................: 542 kB 7.1 kB/s
    data_sent......................: 45 kB  583 B/s



running (1m16.5s), 00/10 VUs, 230 complete and 1 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m0s